[NoCoverage] BlockStatement
Desktop/CRUD-api/src/main.ts:4:28
 import { NestFactory } from '@nestjs/core';
 import { AppModule } from './app.module';
 
-async function bootstrap() {
-  const app = await NestFactory.create(AppModule, {cors: true});
-  app.enableCors();
-  await app.listen(3000);
-}
+async function bootstrap() {}
 bootstrap();
 

[NoCoverage] BooleanLiteral
Desktop/CRUD-api/src/main.ts:5:58
 import { AppModule } from './app.module';
 
 async function bootstrap() {
-  const app = await NestFactory.create(AppModule, {cors: true});
+  const app = await NestFactory.create(AppModule, {cors: false});
   app.enableCors();
   await app.listen(3000);
