[NoCoverage] BlockStatement
CRUD-api/src/user/user.controller.ts:12:54
 	constructor(private readonly userService: UserService) { }
 
 	@Post()
-	public create(@Body() user: User): User | undefined {
-		return this.userService.create(user);
-	}
+	public create(@Body() user: User): User | undefined {}
 
 	@Put(':id')

[NoCoverage] BlockStatement
CRUD-api/src/user/user.controller.ts:17:80
 	}
 
 	@Put(':id')
-	public update(@Param('id') id: string, @Body() user: User): User | undefined  {
-		return this.userService.update(parseInt(id), user);
-	}
+	public update(@Param('id') id: string, @Body() user: User): User | undefined  {}
 
 	@Get()

[NoCoverage] BlockStatement
CRUD-api/src/user/user.controller.ts:22:26
 	}
 
 	@Get()
-	public findAll(): User[]{
-		return this.userService.findAll();
-	}
+	public findAll(): User[]{}
 
 	@Get(':id')

[NoCoverage] BlockStatement
CRUD-api/src/user/user.controller.ts:27:63
 	}
 
 	@Get(':id')
-	public getUserById(@Param('id') id: string): User | undefined{
-		return this.userService.getUserById(parseInt(id));
-	}
+	public getUserById(@Param('id') id: string): User | undefined{}
 
 	@Delete(':id')

[NoCoverage] BlockStatement
CRUD-api/src/user/user.controller.ts:32:50
 	}
 
 	@Delete(':id')
-	public deleteById(@Param('id') id: string): void{
-		return this.userService.deleteById(parseInt(id));
-	}
+	public deleteById(@Param('id') id: string): void{}
 
 	@Delete('/delete-selected')

[NoCoverage] BlockStatement
CRUD-api/src/user/user.controller.ts:37:42
 	}
 
 	@Delete('/delete-selected')
-	public deleteSelected(@Body() ids: any) {
-		return this.userService.deleteUsers(ids);
-	}
+	public deleteSelected(@Body() ids: any) {}
 
 	@Post('/check-email-availability')

[NoCoverage] BlockStatement
CRUD-api/src/user/user.controller.ts:42:91
 	}
 
 	@Post('/check-email-availability')
-	public isEmailTaken(@Body() emails: {formEmail: string, currentEmail?: string}): boolean {
-		return this.userService.isEmailTaken(emails.formEmail, emails.currentEmail);
-	}
+	public isEmailTaken(@Body() emails: {formEmail: string, currentEmail?: string}): boolean {}
 
 }
