[Timeout] BlockStatement
CRUD-api/src/user/user.service.ts:9:47
 export class UserService {
   private userList: User[] = [];
 
-  public create(user: User): User | undefined {
-	if (this.isEmailTaken(user.email)) {
-		return undefined;
-	}
-	this.userList.push(user);
-	return user;
-  }
+  public create(user: User): User | undefined {}
 
   public update(id: number, user: User): User | undefined {

[Timeout] ConditionalExpression
CRUD-api/src/user/user.service.ts:10:6
   private userList: User[] = [];
 
   public create(user: User): User | undefined {
-	if (this.isEmailTaken(user.email)) {
+	if (false) {
 		return undefined;
 	}

[Timeout] BlockStatement
CRUD-api/src/user/user.service.ts:10:37
   private userList: User[] = [];
 
   public create(user: User): User | undefined {
-	if (this.isEmailTaken(user.email)) {
-		return undefined;
-	}
+	if (this.isEmailTaken(user.email)) {}
 	this.userList.push(user);
 	return user;

[Timeout] BlockStatement
CRUD-api/src/user/user.service.ts:17:59
 	return user;
   }
 
-  public update(id: number, user: User): User | undefined {
-		if (this.isEmailTaken(user.email)) {
-      return undefined;
-		}
-		const indexUser = this.findIndexById(id);
-		if (indexUser > -1) {
-		  this.userList[indexUser] = user;
-      return user;
-		}
-		return undefined;
-  }
+  public update(id: number, user: User): User | undefined {}
 
   public getUserById(id: number): User {

[Killed] ConditionalExpression
CRUD-api/src/user/user.service.ts:18:7
   }
 
   public update(id: number, user: User): User | undefined {
-		if (this.isEmailTaken(user.email)) {
+		if (false) {
       return undefined;
 		}
killedBy: UserService update should be updated.
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "email"

Number of calls: 0

[Survived] BlockStatement
CRUD-api/src/user/user.service.ts:18:38
   }
 
   public update(id: number, user: User): User | undefined {
-		if (this.isEmailTaken(user.email)) {
-      return undefined;
-		}
+		if (this.isEmailTaken(user.email)) {}
 		const indexUser = this.findIndexById(id);
 		if (indexUser > -1) {

[Killed] ConditionalExpression
CRUD-api/src/user/user.service.ts:22:7
       return undefined;
 		}
 		const indexUser = this.findIndexById(id);
-		if (indexUser > -1) {
+		if (true) {
 		  this.userList[indexUser] = user;
       return user;
killedBy: UserService update should return undefined because id is not found.
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: undefined
Received: {"email": "email"}

[Timeout] EqualityOperator
CRUD-api/src/user/user.service.ts:22:7
       return undefined;
 		}
 		const indexUser = this.findIndexById(id);
-		if (indexUser > -1) {
+		if (indexUser <= -1) {
 		  this.userList[indexUser] = user;
       return user;

[NoCoverage] BlockStatement
CRUD-api/src/user/user.service.ts:29:40
 		return undefined;
   }
 
-  public getUserById(id: number): User {
-    return this.userList.find((user) => {
-      user.id === id;
-    });
-  }
+  public getUserById(id: number): User {}
 
   public findAll(): User[] {

[NoCoverage] BlockStatement
CRUD-api/src/user/user.service.ts:30:41
   }
 
   public getUserById(id: number): User {
-    return this.userList.find((user) => {
-      user.id === id;
-    });
+    return this.userList.find((user) => {});
   }
 

[NoCoverage] ConditionalExpression
CRUD-api/src/user/user.service.ts:31:7
 
   public getUserById(id: number): User {
     return this.userList.find((user) => {
-      user.id === id;
+      false;
     });
   }

[NoCoverage] ConditionalExpression
CRUD-api/src/user/user.service.ts:31:7
 
   public getUserById(id: number): User {
     return this.userList.find((user) => {
-      user.id === id;
+      true;
     });
   }

[Killed] BlockStatement
CRUD-api/src/user/user.service.ts:35:28
     });
   }
 
-  public findAll(): User[] {
-    return this.userList;
-  }
+  public findAll(): User[] {}
 
   public findIndexById(id: number): number {
killedBy: UserService deleteById should be deleted.
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [{"id": 1}]
Received: undefined

[NoCoverage] BlockStatement
CRUD-api/src/user/user.service.ts:39:44
     return this.userList;
   }
 
-  public findIndexById(id: number): number {
-    for (let i = 0; i < this.userList.length; i++) {
-      if (this.userList[i].id === id) {
-        return i;
-      }
-    }
-    return -1;
-  }
+  public findIndexById(id: number): number {}
 
   public deleteById(id: number): void {

[NoCoverage] ConditionalExpression
CRUD-api/src/user/user.service.ts:40:21
   }
 
   public findIndexById(id: number): number {
-    for (let i = 0; i < this.userList.length; i++) {
+    for (let i = 0; false; i++) {
       if (this.userList[i].id === id) {
         return i;

[NoCoverage] UpdateOperator
CRUD-api/src/user/user.service.ts:40:47
   }
 
   public findIndexById(id: number): number {
-    for (let i = 0; i < this.userList.length; i++) {
+    for (let i = 0; i < this.userList.length; i--) {
       if (this.userList[i].id === id) {
         return i;

[NoCoverage] ConditionalExpression
CRUD-api/src/user/user.service.ts:41:11
 
   public findIndexById(id: number): number {
     for (let i = 0; i < this.userList.length; i++) {
-      if (this.userList[i].id === id) {
+      if (false) {
         return i;
       }

[NoCoverage] ConditionalExpression
CRUD-api/src/user/user.service.ts:41:11
 
   public findIndexById(id: number): number {
     for (let i = 0; i < this.userList.length; i++) {
-      if (this.userList[i].id === id) {
+      if (true) {
         return i;
       }

[Timeout] BlockStatement
CRUD-api/src/user/user.service.ts:48:39
     return -1;
   }
 
-  public deleteById(id: number): void {
-    this.userList = this.userList.filter((user) => user.id !== id);
-  }
+  public deleteById(id: number): void {}
 
   public deleteUsers(ids: number[]): void {

[Killed] ConditionalExpression
CRUD-api/src/user/user.service.ts:49:52
   }
 
   public deleteById(id: number): void {
-    this.userList = this.userList.filter((user) => user.id !== id);
+    this.userList = this.userList.filter((user) => true);
   }
 
killedBy: UserService deleteById should be deleted.
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 0
+ Received  + 3

  Array [
    User {
+     "id": 0,

[Killed] ConditionalExpression
CRUD-api/src/user/user.service.ts:49:52
   }
 
   public deleteById(id: number): void {
-    this.userList = this.userList.filter((user) => user.id !== id);
+    this.userList = this.userList.filter((user) => false);
   }
 
killedBy: UserService deleteById should be deleted.
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 5
+ Received  + 1

- Array [
-   User {
-     "id": 1,

[Killed] BlockStatement
CRUD-api/src/user/user.service.ts:52:43
     this.userList = this.userList.filter((user) => user.id !== id);
   }
 
-  public deleteUsers(ids: number[]): void {
-    for (const id of ids) {
-      this.deleteById(id);
-    }
-  }
+  public deleteUsers(ids: number[]): void {}
 
   public isEmailTaken(
killedBy: UserService deleteUsers should be deleted.
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 8

- Array []
+ Array [
+   User {

[Timeout] BlockStatement
CRUD-api/src/user/user.service.ts:53:27
   }
 
   public deleteUsers(ids: number[]): void {
-    for (const id of ids) {
-      this.deleteById(id);
-    }
+    for (const id of ids) {}
   }
 

[NoCoverage] BlockStatement
CRUD-api/src/user/user.service.ts:61:14
   public isEmailTaken(
     formEmail: string,
     currentEmail?: string,
-  ): boolean {
-    if (formEmail === currentEmail) {
-      return false;
-    }
-    return this.userList.some((user) => user.email === formEmail);
-  }
+  ): boolean {}
 
   private takeARandomIndex(): number{

[NoCoverage] BlockStatement
CRUD-api/src/user/user.service.ts:62:37
     formEmail: string,
     currentEmail?: string,
   ): boolean {
-    if (formEmail === currentEmail) {
-      return false;
-    }
+    if (formEmail === currentEmail) {}
     return this.userList.some((user) => user.email === formEmail);
   }

[NoCoverage] ConditionalExpression
CRUD-api/src/user/user.service.ts:62:9
     formEmail: string,
     currentEmail?: string,
   ): boolean {
-    if (formEmail === currentEmail) {
+    if (true) {
       return false;
     }

[NoCoverage] BooleanLiteral
CRUD-api/src/user/user.service.ts:63:14
     currentEmail?: string,
   ): boolean {
     if (formEmail === currentEmail) {
-      return false;
+      return true;
     }
     return this.userList.some((user) => user.email === formEmail);

[NoCoverage] ConditionalExpression
CRUD-api/src/user/user.service.ts:65:41
     if (formEmail === currentEmail) {
       return false;
     }
-    return this.userList.some((user) => user.email === formEmail);
+    return this.userList.some((user) => false);
   }
 

[NoCoverage] ArrowFunction
CRUD-api/src/user/user.service.ts:65:31
     if (formEmail === currentEmail) {
       return false;
     }
-    return this.userList.some((user) => user.email === formEmail);
+    return this.userList.some(() => undefined);
   }
 

[NoCoverage] BlockStatement
CRUD-api/src/user/user.service.ts:68:37
     return this.userList.some((user) => user.email === formEmail);
   }
 
-  private takeARandomIndex(): number{
-    return Math.floor(Math.random() * this.userList.length);
-  }
+  private takeARandomIndex(): number{}
 
   private isAccountValid(index: number): boolean{

[NoCoverage] ArithmeticOperator
CRUD-api/src/user/user.service.ts:69:23
   }
 
   private takeARandomIndex(): number{
-    return Math.floor(Math.random() * this.userList.length);
+    return Math.floor(Math.random() / this.userList.length);
   }
 

[NoCoverage] BlockStatement
CRUD-api/src/user/user.service.ts:72:49
     return Math.floor(Math.random() * this.userList.length);
   }
 
-  private isAccountValid(index: number): boolean{
-    return this.userList[index].firstName !== ''
-      && this.userList[index].lastName !== ''
-      && this.userList[index].username !== '';
-  }
+  private isAccountValid(index: number): boolean{}
 
   public findSpecialUser(): User | undefined{

[NoCoverage] EqualityOperator
CRUD-api/src/user/user.service.ts:73:12
   }
 
   private isAccountValid(index: number): boolean{
-    return this.userList[index].firstName !== ''
+    return this.userList[index].firstName === ''
       && this.userList[index].lastName !== ''
       && this.userList[index].username !== '';

[NoCoverage] ConditionalExpression
CRUD-api/src/user/user.service.ts:73:12
   }
 
   private isAccountValid(index: number): boolean{
-    return this.userList[index].firstName !== ''
-      && this.userList[index].lastName !== ''
-      && this.userList[index].username !== '';
+    return false;
   }
 

[NoCoverage] ConditionalExpression
CRUD-api/src/user/user.service.ts:74:10
 
   private isAccountValid(index: number): boolean{
     return this.userList[index].firstName !== ''
-      && this.userList[index].lastName !== ''
+      && true
       && this.userList[index].username !== '';
   }

[NoCoverage] EqualityOperator
CRUD-api/src/user/user.service.ts:74:10
 
   private isAccountValid(index: number): boolean{
     return this.userList[index].firstName !== ''
-      && this.userList[index].lastName !== ''
+      && this.userList[index].lastName === ''
       && this.userList[index].username !== '';
   }

[NoCoverage] EqualityOperator
CRUD-api/src/user/user.service.ts:75:10
   private isAccountValid(index: number): boolean{
     return this.userList[index].firstName !== ''
       && this.userList[index].lastName !== ''
-      && this.userList[index].username !== '';
+      && this.userList[index].username === '';
   }
 

[NoCoverage] ConditionalExpression
CRUD-api/src/user/user.service.ts:75:10
   private isAccountValid(index: number): boolean{
     return this.userList[index].firstName !== ''
       && this.userList[index].lastName !== ''
-      && this.userList[index].username !== '';
+      && true;
   }
 

[Timeout] BlockStatement
CRUD-api/src/user/user.service.ts:78:45
       && this.userList[index].username !== '';
   }
 
-  public findSpecialUser(): User | undefined{
-    if (this.userList.length === 0){
-      return;
-    }
-
-    const index = this.takeARandomIndex();
-    if (this.isAccountValid(index)){
-      return this.userList[index];
-    }
-    return;
-  }  
+  public findSpecialUser(): User | undefined{}  
 }
 

[Timeout] ConditionalExpression
CRUD-api/src/user/user.service.ts:79:9
   }
 
   public findSpecialUser(): User | undefined{
-    if (this.userList.length === 0){
+    if (true){
       return;
     }

[Timeout] EqualityOperator
CRUD-api/src/user/user.service.ts:79:9
   }
 
   public findSpecialUser(): User | undefined{
-    if (this.userList.length === 0){
+    if (this.userList.length !== 0){
       return;
     }

[Killed] ConditionalExpression
CRUD-api/src/user/user.service.ts:84:9
     }
 
     const index = this.takeARandomIndex();
-    if (this.isAccountValid(index)){
+    if (true){
       return this.userList[index];
     }
killedBy: UserService findSpecialUser Should be userList has users, but the returning user will not be valid.
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: undefined
Received: {}

[Killed] ConditionalExpression
CRUD-api/src/user/user.service.ts:84:9
     }
 
     const index = this.takeARandomIndex();
-    if (this.isAccountValid(index)){
+    if (false){
       return this.userList[index];
     }
killedBy: UserService findSpecialUser Should be userList has users, but the returning user will not be valid.
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 0

Number of calls: 0
