[Timeout] BlockStatement
CRUD-api/src/user/user.service.ts:9:47
 export class UserService {
   private userList: User[] = [];
 
-  public create(user: User): User | undefined {
-    if (this.isEmailTaken(user.email)) {
-      throw new Error('Email is already taken')
-    }
-    this.userList.push(user);
-    return user;
-  }
+  public create(user: User): User | undefined {}
 
   public update(id: number, user: User): User {

[Timeout] ConditionalExpression
CRUD-api/src/user/user.service.ts:10:9
   private userList: User[] = [];
 
   public create(user: User): User | undefined {
-    if (this.isEmailTaken(user.email)) {
+    if (true) {
       throw new Error('Email is already taken')
     }

[Timeout] BlockStatement
CRUD-api/src/user/user.service.ts:17:47
     return user;
   }
 
-  public update(id: number, user: User): User {
-    if (this.isEmailTaken(user.email)) {
-      throw new Error('Email is already taken')
-    }
-    const indexUser = this.findIndexById(id);
-    if (indexUser > -1) {
-      this.userList[indexUser] = user;
-      return user;
-    }
-    return undefined;
-  }
+  public update(id: number, user: User): User {}
 
   public getUserById(id: number): User {

[Killed] ConditionalExpression
CRUD-api/src/user/user.service.ts:18:9
   }
 
   public update(id: number, user: User): User {
-    if (this.isEmailTaken(user.email)) {
+    if (false) {
       throw new Error('Email is already taken')
     }
killedBy: UserService update should be updated.
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "email"

Number of calls: 0

[Killed] ConditionalExpression
CRUD-api/src/user/user.service.ts:18:9
   }
 
   public update(id: number, user: User): User {
-    if (this.isEmailTaken(user.email)) {
+    if (true) {
       throw new Error('Email is already taken')
     }
killedBy: UserService update should be updated.
statusReason: Error: Email is already taken

[Killed] EqualityOperator
CRUD-api/src/user/user.service.ts:22:9
       throw new Error('Email is already taken')
     }
     const indexUser = this.findIndexById(id);
-    if (indexUser > -1) {
+    if (indexUser >= -1) {
       this.userList[indexUser] = user;
       return user;
killedBy: UserService update should throw error because id is not found.
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: undefined
Received: {"email": "email"}

[NoCoverage] BlockStatement
CRUD-api/src/user/user.service.ts:58:74
     }
   }
 
-  public isEmailTaken(formEmail: string, currentEmail?: string): boolean {
-    if (formEmail === currentEmail) {
-      return false;
-    }
-    return this.userList.some((user) => user.email === formEmail);
-  }
+  public isEmailTaken(formEmail: string, currentEmail?: string): boolean {}
 
   

[NoCoverage] ConditionalExpression
CRUD-api/src/user/user.service.ts:59:9
   }
 
   public isEmailTaken(formEmail: string, currentEmail?: string): boolean {
-    if (formEmail === currentEmail) {
+    if (false) {
       return false;
     }

[NoCoverage] EqualityOperator
CRUD-api/src/user/user.service.ts:59:9
   }
 
   public isEmailTaken(formEmail: string, currentEmail?: string): boolean {
-    if (formEmail === currentEmail) {
+    if (formEmail !== currentEmail) {
       return false;
     }

[NoCoverage] EqualityOperator
CRUD-api/src/user/user.service.ts:62:41
     if (formEmail === currentEmail) {
       return false;
     }
-    return this.userList.some((user) => user.email === formEmail);
+    return this.userList.some((user) => user.email !== formEmail);
   }
 

[NoCoverage] LogicalOperator
CRUD-api/src/user/user.service.ts:67:12
 
   
   private isAccountValid(index: number): boolean {
-    return this.userList[index].firstName !== ''
-    && this.userList[index].lastName !== ''
+    return this.userList[index].firstName !== '' || this.userList[index].lastName !== ''
     && this.userList[index].username !== '';
   }

[Timeout] BlockStatement
CRUD-api/src/user/user.service.ts:76:45
     return Math.floor(Math.random() * this.userList.length);
   }
   
-  public findRandomUser(): User | undefined {
-    if (this.userList.length === 0) {
-      return;
-    }
-
-    const index = this.takeARandomIndex();
-    if (this.isAccountValid(index)) {
-      return this.userList[index];
-    }
-    return;
-  }
+  public findRandomUser(): User | undefined {}
 
   public div(a: number, b: number) {

[Killed] BlockStatement
CRUD-api/src/user/user.service.ts:77:37
   }
   
   public findRandomUser(): User | undefined {
-    if (this.userList.length === 0) {
-      return;
-    }
+    if (this.userList.length === 0) {}
 
     const index = this.takeARandomIndex();
killedBy: UserService findRandomUser Should return undefined if userList is empty.
statusReason: TypeError: Cannot read property 'firstName' of undefined

[Killed] ConditionalExpression
CRUD-api/src/user/user.service.ts:77:9
   }
   
   public findRandomUser(): User | undefined {
-    if (this.userList.length === 0) {
+    if (false) {
       return;
     }
killedBy: UserService findRandomUser Should return undefined if userList is empty.
statusReason: TypeError: Cannot read property 'firstName' of undefined

[Killed] BlockStatement
CRUD-api/src/user/user.service.ts:82:37
     }
 
     const index = this.takeARandomIndex();
-    if (this.isAccountValid(index)) {
-      return this.userList[index];
-    }
+    if (this.isAccountValid(index)) {}
     return;
   }
killedBy: UserService findRandomUser Should be userList has users, but the returning user will be valid.
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {}
Received: undefined

[Killed] BlockStatement
CRUD-api/src/user/user.service.ts:88:36
     return;
   }
 
-  public div(a: number, b: number) {
-    if (b === 0) {
-      throw new Error('Cannot divide by 0');
-    }
-    return a / b;
-  }
+  public div(a: number, b: number) {}
 
 
killedBy: UserService sum Should return the result of the division
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 3
Received: undefined

[Killed] ConditionalExpression
CRUD-api/src/user/user.service.ts:89:9
   }
 
   public div(a: number, b: number) {
-    if (b === 0) {
+    if (true) {
       throw new Error('Cannot divide by 0');
     }
killedBy: UserService sum Should return the result of the division
statusReason: Error: Cannot divide by 0

[Killed] BlockStatement
CRUD-api/src/user/user.service.ts:89:18
   }
 
   public div(a: number, b: number) {
-    if (b === 0) {
-      throw new Error('Cannot divide by 0');
-    }
+    if (b === 0) {}
     return a / b;
   }
killedBy: UserService sum should throw an exception
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Cannot divide by 0"

Received function did not throw
